---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpotElevFlipTextVert
source: html/d063e7e0-8c82-f5ec-eb1d-dc2a5b08a7bc.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpotElevFlipTextVert Property

"Auto Mirror"

## Syntax (C#)
```csharp
public static ForgeTypeId SpotElevFlipTextVert { get; }
```